Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateCorniceIntegral Property
 Could not create integral wall sweep for wall instance. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateCorniceIntegral { get; }
Public Shared ReadOnly Property CannotCreateCorniceIntegral As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateCorniceIntegral {
	FailureDefinitionId^ get ();
}
static member CannotCreateCorniceIntegral : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace